src/main/resources/SOAP 예시/ktf/MM7_delivery_report.REQ.xml

<?xml version="1.0" encoding="euc-kr"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header>
        <mm7:TransactionID
                xmlns:mm7="http://www.3gpp.org/ftp/Specs/archive/23_series/23.140/schema/REL-5-MM7-1-0" env:mustUnderstand="1">
            c9131c:10822bc0263:-7c16t-uapl-05/192.168.151.72
        </mm7:TransactionID>
    </env:Header>
    <env:Body>
        <mm7:DeliveryReportReq xmlns:mm7="http://www.3gpp.org/ftp/Specs/archive/23_series/23.140/schema/REL-5-MM7-1-0">
            <MM7Version>1.0</MM7Version>
            <MessageID>01210005_20051215130409809</MessageID>
            <Recipient>
                <Number>0182189000</Number>
            </Recipient>
            <Sender>
                <Number>0168703782</Number>
            </Sender>
            <TimeStamp>2005-12-15T13:04:27+09:00</TimeStamp>
            <MMStatus>1000</MMStatus>
        </mm7:DeliveryReportReq>
    </env:Body>
</env:Envelope>